stevenj/avr-libc3/include/avr/io/atmega8515.h
/* Sign Bit */
typedef enum CPU_S_enum
{
    CPU_S_CLEAR_gc = (0x00), /* Sign Bit - CLEAR */
    CPU_S_SET_gc   = (0x10), /* Sign Bit - SET */
} CPU_S_t;

/* Two's Complement Overflow Flag */
typedef enum CPU_V_enum
{
    CPU_V_CLEAR_gc = (0x00), /* Two's Complement Overflow Flag - CLEAR */
    CPU_V_SET_gc   = (0x08), /* Two's Complement Overflow Flag - SET */
} CPU_V_t;

/* Negative Flag */
typedef enum CPU_N_enum
{
    CPU_N_CLEAR_gc = (0x00), /* Negative Flag - CLEAR */
    CPU_N_SET_gc   = (0x04), /* Negative Flag - SET */
} CPU_N_t;

/* Zero Flag */
typedef enum CPU_Z_enum
{
    CPU_Z_CLEAR_gc = (0x00), /* Zero Flag - CLEAR */
    CPU_Z_SET_gc   = (0x02), /* Zero Flag - SET */
} CPU_Z_t;

/* Carry Flag */
typedef enum CPU_C_enum
{
    CPU_C_CLEAR_gc = (0x00), /* Carry Flag - CLEAR */
    CPU_C_SET_gc   = (0x01), /* Carry Flag - SET */
} CPU_C_t;

/* Sleep Mode Select Bit 0 */
typedef enum CPU_SM0_enum
{
    CPU_SM0_CLEAR_gc = (0x00), /* Sleep Mode Select Bit 0 - CLEAR */
    CPU_SM0_SET_gc   = (0x80), /* Sleep Mode Select Bit 0 - SET */
} CPU_SM0_t;

/* Wait State Selector Limit bits */
typedef enum CPU_SRL_enum
{
    CPU_SRL_VAL_0x00_gc = (0x00<<4), /* LS = N/A, US = 0x1100 - 0xFFFF */
    CPU_SRL_VAL_0x01_gc = (0x01<<4), /* LS = 0x1100 - 0x1FFF, US = 0x2000 - 0xFFFF */
    CPU_SRL_VAL_0x02_gc = (0x02<<4), /* LS = 0x1100 - 0x3FFF, US = 0x4000 - 0xFFFF */
    CPU_SRL_VAL_0x03_gc = (0x03<<4), /* LS = 0x1100 - 0x5FFF, US = 0x6000 - 0xFFFF */
    CPU_SRL_VAL_0x04_gc = (0x04<<4), /* LS = 0x1100 - 0x7FFF, US = 0x8000 - 0xFFFF */
    CPU_SRL_VAL_0x05_gc = (0x05<<4), /* LS = 0x1100 - 0x9FFF, US = 0xA000 - 0xFFFF */
    CPU_SRL_VAL_0x06_gc = (0x06<<4), /* LS = 0x1100 - 0xBFFF, US = 0xC000 - 0xFFFF */
    CPU_SRL_VAL_0x07_gc = (0x07<<4), /* LS = 0x1100 - 0xDFFF, US = 0xE000 - 0xFFFF */
} CPU_SRL_t;

/* Wait State Select Bits for Lower Sector, bits */
typedef enum CPU_SRW0_enum
{
    CPU_SRW0_VAL_0x00_gc = (0x00<<2), /* No wait-states */
    CPU_SRW0_VAL_0x01_gc = (0x01<<2), /* Wait one cycle during read/write strobe */
    CPU_SRW0_VAL_0x02_gc = (0x02<<2), /* Wait two cycles during read/write strobe */
    CPU_SRW0_VAL_0x03_gc = (0x03<<2), /* Wait two cycles during read/write and wait one cycle before driving out new address */
} CPU_SRW0_t;

/* Wait State Select Bits for Upper Sector, bit 1 */
typedef enum CPU_SRW11_enum
{
    CPU_SRW11_CLEAR_gc = (0x00), /* Wait State Select Bits for Upper Sector, bit 1 - CLEAR */
    CPU_SRW11_SET_gc   = (0x02), /* Wait State Select Bits for Upper Sector, bit 1 - SET */
} CPU_SRW11_t;

/* Interrupt Sense Control 2 */
typedef enum CPU_ISC2_enum
{
    CPU_ISC2_CLEAR_gc = (0x00), /* Interrupt Sense Control 2 - CLEAR */
    CPU_ISC2_SET_gc   = (0x01), /* Interrupt Sense Control 2 - SET */
} CPU_ISC2_t;

/* External SRAM/XMEM Enable */
typedef enum CPU_SRE_enum
{
    CPU_SRE_CLEAR_gc = (0x00), /* External SRAM/XMEM Enable - CLEAR */
    CPU_SRE_SET_gc   = (0x80), /* External SRAM/XMEM Enable - SET */
} CPU_SRE_t;

/* Wait State Select Bits for Upper Sector, bit 0 */
typedef enum CPU_SRW10_enum
{
    CPU_SRW10_CLEAR_gc = (0x00), /* Wait State Select Bits for Upper Sector, bit 0 - CLEAR */
    CPU_SRW10_SET_gc   = (0x40), /* Wait State Select Bits for Upper Sector, bit 0 - SET */
} CPU_SRW10_t;

/* Sleep Enable */
typedef enum CPU_SE_enum
{
    CPU_SE_CLEAR_gc = (0x00), /* Sleep Enable - CLEAR */
    CPU_SE_SET_gc   = (0x20), /* Sleep Enable - SET */
} CPU_SE_t;

/* Sleep Mode Select Bit 1 */
typedef enum CPU_SM1_enum
{
    CPU_SM1_CLEAR_gc = (0x00), /* Sleep Mode Select Bit 1 - CLEAR */
    CPU_SM1_SET_gc   = (0x10), /* Sleep Mode Select Bit 1 - SET */
} CPU_SM1_t;

/* Interrupt Sense Control 1 Bits */
typedef enum CPU_ISC1_enum
{
    CPU_ISC1_VAL_0x00_gc = (0x00<<2), /* Low Level of INTX */
    CPU_ISC1_VAL_0x01_gc = (0x01<<2), /* Any Logical Change in INTX */
    CPU_ISC1_VAL_0x02_gc = (0x02<<2), /* Falling Edge of INTX */
    CPU_ISC1_VAL_0x03_gc = (0x03<<2), /* Rising Edge of INTX */
} CPU_ISC1_t;

/* Interrupt Sense Control 0 Bits */
typedef enum CPU_ISC0_enum
{
    CPU_ISC0_VAL_0x00_gc = (0x00), /* Low Level of INTX */
    CPU_ISC0_VAL_0x01_gc = (0x01), /* Any Logical Change in INTX */
    CPU_ISC0_VAL_0x02_gc = (0x02), /* Falling Edge of INTX */
    CPU_ISC0_VAL_0x03_gc = (0x03), /* Rising Edge of INTX */
} CPU_ISC0_t;

/* Sleep Mode Select Bit 2 */
typedef enum CPU_SM2_enum
{
    CPU_SM2_CLEAR_gc = (0x00), /* Sleep Mode Select Bit 2 - CLEAR */
    CPU_SM2_SET_gc   = (0x20), /* Sleep Mode Select Bit 2 - SET */
} CPU_SM2_t;

/* Watchdog Reset Flag */
typedef enum CPU_WDRF_enum
{
    CPU_WDRF_CLEAR_gc = (0x00), /* Watchdog Reset Flag - CLEAR */
    CPU_WDRF_SET_gc   = (0x08), /* Watchdog Reset Flag - SET */
} CPU_WDRF_t;

/* Brown-out Reset Flag */
typedef enum CPU_BORF_enum
{
    CPU_BORF_CLEAR_gc = (0x00), /* Brown-out Reset Flag - CLEAR */
    CPU_BORF_SET_gc   = (0x04), /* Brown-out Reset Flag - SET */
} CPU_BORF_t;

/* External Reset Flag */
typedef enum CPU_EXTRF_enum
{
    CPU_EXTRF_CLEAR_gc = (0x00), /* External Reset Flag - CLEAR */
    CPU_EXTRF_SET_gc   = (0x02), /* External Reset Flag - SET */
} CPU_EXTRF_t;

/* Power-on reset flag */
typedef enum CPU_PORF_enum
{
    CPU_PORF_CLEAR_gc = (0x00), /* Power-on reset flag - CLEAR */
    CPU_PORF_SET_gc   = (0x01), /* Power-on reset flag - SET */
} CPU_PORF_t;

/* SPM Interrupt Enable */
typedef enum CPU_SPMIE_enum
{
    CPU_SPMIE_CLEAR_gc = (0x00), /* SPM Interrupt Enable - CLEAR */
    CPU_SPMIE_SET_gc   = (0x80), /* SPM Interrupt Enable - SET */
} CPU_SPMIE_t;

/* Read-While-Write Section Busy */
typedef enum CPU_RWWSB_enum
{
    CPU_RWWSB_CLEAR_gc = (0x00), /* Read-While-Write Section Busy - CLEAR */
    CPU_RWWSB_SET_gc   = (0x40), /* Read-While-Write Section Busy - SET */
} CPU_RWWSB_t;

/* Read-While-Write Section Read Enable */
typedef enum CPU_RWWSRE_enum
{
    CPU_RWWSRE_CLEAR_gc = (0x00), /* Read-While-Write Section Read Enable - CLEAR */
    CPU_RWWSRE_SET_gc   = (0x10), /* Read-While-Write Section Read Enable - SET */
} CPU_RWWSRE_t;

/* Boot Lock Bit Set */
typedef enum CPU_BLBSET_enum
{
    CPU_BLBSET_CLEAR_gc = (0x00), /* Boot Lock Bit Set - CLEAR */
    CPU_BLBSET_SET_gc   = (0x08), /* Boot Lock Bit Set - SET */
} CPU_BLBSET_t;

