stevenj/avr-libc3/include/avr/io/atmega8515.h
/* Page Write */
typedef enum CPU_PGWRT_enum
{
    CPU_PGWRT_CLEAR_gc = (0x00), /* Page Write - CLEAR */
    CPU_PGWRT_SET_gc   = (0x04), /* Page Write - SET */
} CPU_PGWRT_t;

/* Page Erase */
typedef enum CPU_PGERS_enum
{
    CPU_PGERS_CLEAR_gc = (0x00), /* Page Erase - CLEAR */
    CPU_PGERS_SET_gc   = (0x02), /* Page Erase - SET */
} CPU_PGERS_t;

/* Store Program Memory Enable */
typedef enum CPU_SPMEN_enum
{
    CPU_SPMEN_CLEAR_gc = (0x00), /* Store Program Memory Enable - CLEAR */
    CPU_SPMEN_SET_gc   = (0x01), /* Store Program Memory Enable - SET */
} CPU_SPMEN_t;

/* External Memory Bus Keeper Enable */
typedef enum CPU_XMBK_enum
{
    CPU_XMBK_CLEAR_gc = (0x00), /* External Memory Bus Keeper Enable - CLEAR */
    CPU_XMBK_SET_gc   = (0x40), /* External Memory Bus Keeper Enable - SET */
} CPU_XMBK_t;

/* External Memory High Mask Bits */
#define CPU_SFIOR_XMM_gc(x) ((x<<3) & 0x38)

/* Pull-up Disable */
typedef enum CPU_PUD_enum
{
    CPU_PUD_CLEAR_gc = (0x00), /* Pull-up Disable - CLEAR */
    CPU_PUD_SET_gc   = (0x04), /* Pull-up Disable - SET */
} CPU_PUD_t;

/* Prescaler Reset Timer / Counter 1 and Timer / Counter 0 */
typedef enum CPU_PSR10_enum
{
    CPU_PSR10_CLEAR_gc = (0x00), /* Prescaler Reset Timer / Counter 1 and Timer / Counter 0 - CLEAR */
    CPU_PSR10_SET_gc   = (0x01), /* Prescaler Reset Timer / Counter 1 and Timer / Counter 0 - SET */
} CPU_PSR10_t;

/*
--------------------------------------------------------------------------------
EXINT - External Interrupts
--------------------------------------------------------------------------------
*/

typedef struct EXINT_struct
{
    register8_t rsv_0x00[90]; /* RESERVED REGISTER BLOCK */
    register8_t GIFR;         /* General Interrupt Flag Register */
    register8_t GICR;         /* General Interrupt Control Register */
} EXINT_t;


/* External Interrupt Request 0 Enable */
typedef enum EXINT_INT0_enum
{
    EXINT_INT0_CLEAR_gc = (0x00), /* External Interrupt Request 0 Enable - CLEAR */
    EXINT_INT0_SET_gc   = (0x40), /* External Interrupt Request 0 Enable - SET */
} EXINT_INT0_t;

/* External Interrupt Request 1 Enable */
typedef enum EXINT_INT1_enum
{
    EXINT_INT1_CLEAR_gc = (0x00), /* External Interrupt Request 1 Enable - CLEAR */
    EXINT_INT1_SET_gc   = (0x80), /* External Interrupt Request 1 Enable - SET */
} EXINT_INT1_t;

/* External Interrupt Request 2 Enable */
typedef enum EXINT_INT2_enum
{
    EXINT_INT2_CLEAR_gc = (0x00), /* External Interrupt Request 2 Enable - CLEAR */
    EXINT_INT2_SET_gc   = (0x20), /* External Interrupt Request 2 Enable - SET */
} EXINT_INT2_t;

/* Interrupt Vector Select */
typedef enum EXINT_IVSEL_enum
{
    EXINT_IVSEL_CLEAR_gc = (0x00), /* Interrupt Vector Select - CLEAR */
    EXINT_IVSEL_SET_gc   = (0x02), /* Interrupt Vector Select - SET */
} EXINT_IVSEL_t;

/* Interrupt Vector Change Enable */
typedef enum EXINT_IVCE_enum
{
    EXINT_IVCE_CLEAR_gc = (0x00), /* Interrupt Vector Change Enable - CLEAR */
    EXINT_IVCE_SET_gc   = (0x01), /* Interrupt Vector Change Enable - SET */
} EXINT_IVCE_t;

/* External Interrupt Flags */
#define EXINT_GIFR_INTF_gc(x) ((x<<6) & 0xC0)

/* External Interrupt Flag 2 */
typedef enum EXINT_INTF2_enum
{
    EXINT_INTF2_CLEAR_gc = (0x00), /* External Interrupt Flag 2 - CLEAR */
    EXINT_INTF2_SET_gc   = (0x20), /* External Interrupt Flag 2 - SET */
} EXINT_INTF2_t;

/*
--------------------------------------------------------------------------------
WDT - Watchdog Timer
--------------------------------------------------------------------------------
*/

typedef struct WDT_struct
{
    register8_t rsv_0x00[65]; /* RESERVED REGISTER BLOCK */
    register8_t WDTCR;        /* Watchdog Timer Control Register */
} WDT_t;


/* Watchdog Change Enable */
typedef enum WDT_WDCE_enum
{
    WDT_WDCE_CLEAR_gc = (0x00), /* Watchdog Change Enable - CLEAR */
    WDT_WDCE_SET_gc   = (0x10), /* Watchdog Change Enable - SET */
} WDT_WDCE_t;

/* Watch Dog Enable */
typedef enum WDT_WDE_enum
{
    WDT_WDE_CLEAR_gc = (0x00), /* Watch Dog Enable - CLEAR */
    WDT_WDE_SET_gc   = (0x08), /* Watch Dog Enable - SET */
} WDT_WDE_t;

/* Watch Dog Timer Prescaler bits */
typedef enum WDT_WDP_enum
{
    WDT_WDP_VAL_0x00_gc = (0x00), /* Oscillator Cycles 16K */
    WDT_WDP_VAL_0x01_gc = (0x01), /* Oscillator Cycles 32K */
    WDT_WDP_VAL_0x02_gc = (0x02), /* Oscillator Cycles 64K */
    WDT_WDP_VAL_0x03_gc = (0x03), /* Oscillator Cycles 128K */
    WDT_WDP_VAL_0x04_gc = (0x04), /* Oscillator Cycles 256K */
    WDT_WDP_VAL_0x05_gc = (0x05), /* Oscillator Cycles 512K */
    WDT_WDP_VAL_0x06_gc = (0x06), /* Oscillator Cycles 1024K */
    WDT_WDP_VAL_0x07_gc = (0x07), /* Oscillator Cycles 2048K */
} WDT_WDP_t;

/*
--------------------------------------------------------------------------------
TC8 - Timer/Counter, 8-bit
--------------------------------------------------------------------------------
*/

typedef struct TC0_struct
{
    register8_t rsv_0x00[81]; /* RESERVED REGISTER BLOCK */
    register8_t OCR0;         /* Timer/Counter 0 Output Compare Register */
    register8_t TCNT0;        /* Timer/Counter 0 Register */
    register8_t TCCR0;        /* Timer/Counter 0 Control Register */
    register8_t rsv_0x54[4];  /* RESERVED REGISTER BLOCK */
    register8_t TIFR;         /* Timer/Counter Interrupt Flag register */
    register8_t TIMSK;        /* Timer/Counter Interrupt Mask Register */
} TC0_t;


/* Force Output Compare */
typedef enum TC0_FOC0_enum
{
    TC0_FOC0_CLEAR_gc = (0x00), /* Force Output Compare - CLEAR */
    TC0_FOC0_SET_gc   = (0x80), /* Force Output Compare - SET */
} TC0_FOC0_t;

/* Waveform Generation Mode 0 */
typedef enum TC0_WGM00_enum
{
    TC0_WGM00_VAL_0x00_gc = (0x00<<6), /* Normal */
    TC0_WGM00_VAL_0x02_gc = (0x02<<6), /* PWM, Phase Correct */
    TC0_WGM00_VAL_0x01_gc = (0x01<<6), /* CTC */
    TC0_WGM00_VAL_0x03_gc = (0x03<<6), /* Fast PWM */
} TC0_WGM00_t;

/* Compare Match Output Modes */
#define TC0_TCCR0_COM0_gc(x) ((x<<4) & 0x30)

/* Waveform Generation Mode 1 */
typedef enum TC0_WGM01_enum
{
    TC0_WGM01_CLEAR_gc = (0x00), /* Waveform Generation Mode 1 - CLEAR */
    TC0_WGM01_SET_gc   = (0x08), /* Waveform Generation Mode 1 - SET */
} TC0_WGM01_t;

/* Clock Selects */
typedef enum TC0_CS0_enum
{
    TC0_CS0_VAL_0x00_gc = (0x00), /* No Clock Source (Stopped) */
    TC0_CS0_VAL_0x01_gc = (0x01), /* Running, No Prescaling */
    TC0_CS0_VAL_0x02_gc = (0x02), /* Running, CLK/8 */
    TC0_CS0_VAL_0x03_gc = (0x03), /* Running, CLK/64 */
    TC0_CS0_VAL_0x04_gc = (0x04), /* Running, CLK/256 */
    TC0_CS0_VAL_0x05_gc = (0x05), /* Running, CLK/1024 */
    TC0_CS0_VAL_0x06_gc = (0x06), /* Running, ExtClk Tx Falling Edge */
    TC0_CS0_VAL_0x07_gc = (0x07), /* Running, ExtClk Tx Rising Edge */
} TC0_CS0_t;

/* Timer/Counter0 Overflow Interrupt Enable */
typedef enum TC0_TOIE0_enum
{
    TC0_TOIE0_CLEAR_gc = (0x00), /* Timer/Counter0 Overflow Interrupt Enable - CLEAR */
    TC0_TOIE0_SET_gc   = (0x02), /* Timer/Counter0 Overflow Interrupt Enable - SET */
} TC0_TOIE0_t;

/* Timer/Counter0 Output Compare Match Interrupt register */
typedef enum TC0_OCIE0_enum
{
    TC0_OCIE0_CLEAR_gc = (0x00), /* Timer/Counter0 Output Compare Match Interrupt register - CLEAR */
    TC0_OCIE0_SET_gc   = (0x01), /* Timer/Counter0 Output Compare Match Interrupt register - SET */
} TC0_OCIE0_t;

/* Timer/Counter0 Overflow Flag */
typedef enum TC0_TOV0_enum
{
    TC0_TOV0_CLEAR_gc = (0x00), /* Timer/Counter0 Overflow Flag - CLEAR */
    TC0_TOV0_SET_gc   = (0x02), /* Timer/Counter0 Overflow Flag - SET */
} TC0_TOV0_t;

