stevenj/avr-libc3/include/avr/io/atmega8515.h
/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/

typedef struct PORTC_struct
{
    register8_t rsv_0x00[51]; /* RESERVED REGISTER BLOCK */
    register8_t PINC;         /* Port C Input Pins */
    register8_t DDRC;         /* Port C Data Direction Register */
    register8_t PORTC;        /* Port C Data Register */
} PORTC_t;


/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/

typedef struct PORTD_struct
{
    register8_t rsv_0x00[48]; /* RESERVED REGISTER BLOCK */
    register8_t PIND;         /* Port D Input Pins */
    register8_t DDRD;         /* Port D Data Direction Register */
    register8_t PORTD;        /* Port D Data Register */
} PORTD_t;


/*
--------------------------------------------------------------------------------
PORT - I/O Port
--------------------------------------------------------------------------------
*/

typedef struct PORTE_struct
{
    register8_t rsv_0x00[37]; /* RESERVED REGISTER BLOCK */
    register8_t PINE;         /* Port E Input Pins */
    register8_t DDRE;         /* Port E Data Direction Register */
    register8_t PORTE;        /* Port E Data Register */
} PORTE_t;


/*
--------------------------------------------------------------------------------
EEPROM - EEPROM
--------------------------------------------------------------------------------
*/

typedef struct EEPROM_struct
{
    register8_t rsv_0x00[60]; /* RESERVED REGISTER BLOCK */
    register8_t EECR;         /* EEPROM Control Register */
    register8_t EEDR;         /* EEPROM Data Register */
    _REGISTER16 (EEAR);       /* EEPROM Address Register  Bytes */
} EEPROM_t;


/* EEPROM Ready Interrupt Enable */
typedef enum EEPROM_EERIE_enum
{
    EEPROM_EERIE_CLEAR_gc = (0x00), /* EEPROM Ready Interrupt Enable - CLEAR */
    EEPROM_EERIE_SET_gc   = (0x08), /* EEPROM Ready Interrupt Enable - SET */
} EEPROM_EERIE_t;

/* EEPROM Master Write Enable */
typedef enum EEPROM_EEMWE_enum
{
    EEPROM_EEMWE_CLEAR_gc = (0x00), /* EEPROM Master Write Enable - CLEAR */
    EEPROM_EEMWE_SET_gc   = (0x04), /* EEPROM Master Write Enable - SET */
} EEPROM_EEMWE_t;

/* EEPROM Write Enable */
typedef enum EEPROM_EEWE_enum
{
    EEPROM_EEWE_CLEAR_gc = (0x00), /* EEPROM Write Enable - CLEAR */
    EEPROM_EEWE_SET_gc   = (0x02), /* EEPROM Write Enable - SET */
} EEPROM_EEWE_t;

/* EEPROM Read Enable */
typedef enum EEPROM_EERE_enum
{
    EEPROM_EERE_CLEAR_gc = (0x00), /* EEPROM Read Enable - CLEAR */
    EEPROM_EERE_SET_gc   = (0x01), /* EEPROM Read Enable - SET */
} EEPROM_EERE_t;
/*
================================================================================
IO Module Instances. Mapped to memory.
================================================================================
*/

#define AC      (*(AC_t *) 0x0000)      /* Analog Comparator */
#define USART   (*(USART_t *) 0x0000)   /* USART */
#define SPI     (*(SPI_t *) 0x0000)     /* Serial Peripheral Interface */
#define CPU     (*(CPU_t *) 0x0000)     /* CPU Registers */
#define EXINT   (*(EXINT_t *) 0x0000)   /* External Interrupts */
#define WDT     (*(WDT_t *) 0x0000)     /* Watchdog Timer */
#define TC0     (*(TC0_t *) 0x0000)     /* Timer/Counter, 8-bit */
#define TC1     (*(TC1_t *) 0x0000)     /* Timer/Counter, 16-bit */
#define PORTA   (*(PORTA_t *) 0x0000)   /* I/O Port */
#define PORTB   (*(PORTB_t *) 0x0000)   /* I/O Port */
#define PORTC   (*(PORTC_t *) 0x0000)   /* I/O Port */
#define PORTD   (*(PORTD_t *) 0x0000)   /* I/O Port */
#define PORTE   (*(PORTE_t *) 0x0000)   /* I/O Port */
#define EEPROM  (*(EEPROM_t *) 0x0000)  /* EEPROM */
#define FUSE    (*(FUSE_t *) 0x0000)    /* Fuses */
#define LOCKBIT (*(LOCKBIT_t *) 0x0000) /* Lockbits */
#else
/*
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
ASM LANGUAGE - ONLY
~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
*/


/*
--------------------------------------------------------------------------------
FUSE - Fuses
--------------------------------------------------------------------------------
*/


/* AT90S4414/8515 compatibility mode */
#define FUSE_S8515C_CLEAR_gc (0x00) /* AT90S4414/8515 compatibility mode - CLEAR */
#define FUSE_S8515C_SET_gc   (0x80) /* AT90S4414/8515 compatibility mode - SET */


/* Watch-dog Timer always on */
#define FUSE_WDTON_CLEAR_gc (0x00) /* Watch-dog Timer always on - CLEAR */
#define FUSE_WDTON_SET_gc   (0x40) /* Watch-dog Timer always on - SET */


/* Serial program downloading (SPI) enabled */
#define FUSE_SPIEN_CLEAR_gc (0x00) /* Serial program downloading (SPI) enabled - CLEAR */
#define FUSE_SPIEN_SET_gc   (0x20) /* Serial program downloading (SPI) enabled - SET */


/* Preserve EEPROM through the Chip Erase cycle */
#define FUSE_EESAVE_CLEAR_gc (0x00) /* Preserve EEPROM through the Chip Erase cycle - CLEAR */
#define FUSE_EESAVE_SET_gc   (0x08) /* Preserve EEPROM through the Chip Erase cycle - SET */


/* Select Boot Size */
#define FUSE_BOOTSZ_128W_0F80_gc  (0x03<<1) /* Boot Flashsize=128 words Boot address=$0F80 */
#define FUSE_BOOTSZ_256W_0F00_gc  (0x02<<1) /* Boot Flash size=256 words Boot address=$0F00 */
#define FUSE_BOOTSZ_512W_0E00_gc  (0x01<<1) /* Boot Flash size=512 words Boot address=$0E00 */
#define FUSE_BOOTSZ_1024W_0C00_gc (0x00<<1) /* Boot Flash size=1024 words Boot address=$0C00 */


/* Boot Reset vector Enabled */
#define FUSE_BOOTRST_CLEAR_gc (0x00) /* Boot Reset vector Enabled - CLEAR */
#define FUSE_BOOTRST_SET_gc   (0x01) /* Boot Reset vector Enabled - SET */


/* CKOPT fuse (operation dependent of CKSEL fuses)] */
#define FUSE_CKOPT_CLEAR_gc (0x00) /* CKOPT fuse (operation dependent of CKSEL fuses)] - CLEAR */
#define FUSE_CKOPT_SET_gc   (0x10) /* CKOPT fuse (operation dependent of CKSEL fuses)] - SET */


/* Brownout detector trigger level */
#define FUSE_BODLEVEL_4V0_gc (0x00<<7) /* Brown-out detection at VCC=4.0 V */
#define FUSE_BODLEVEL_2V7_gc (0x01<<7) /* Brown-out detection at VCC=2.7 V */


/* Brown-out detection enabled */
#define FUSE_BODEN_CLEAR_gc (0x00) /* Brown-out detection enabled - CLEAR */
#define FUSE_BODEN_SET_gc   (0x40) /* Brown-out detection enabled - SET */


/* Select Clock Source */
#define FUSE_SUT_CKSEL_EXTCLK_6CK_0MS_gc                (0x00) /* Ext. Clock; Start-up time: 6 CK + 0 ms */
#define FUSE_SUT_CKSEL_EXTCLK_6CK_4MS_gc                (0x10) /* Ext. Clock; Start-up time: 6 CK + 4 ms */
#define FUSE_SUT_CKSEL_EXTCLK_6CK_64MS_gc               (0x20) /* Ext. Clock; Start-up time: 6 CK + 64 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_1MHZ_6CK_0MS_gc         (0x01) /* Int. RC Osc. 1 MHz; Start-up time: 6 CK + 0 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_1MHZ_6CK_4MS_gc         (0x11) /* Int. RC Osc. 1 MHz; Start-up time: 6 CK + 4 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_1MHZ_6CK_64MS_gc        (0x21) /* Int. RC Osc. 1 MHz; Start-up time: 6 CK + 64 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_2MHZ_6CK_0MS_gc         (0x02) /* Int. RC Osc. 2 MHz; Start-up time: 6 CK + 0 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_2MHZ_6CK_4MS_gc         (0x12) /* Int. RC Osc. 2 MHz; Start-up time: 6 CK + 4 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_2MHZ_6CK_64MS_gc        (0x22) /* Int. RC Osc. 2 MHz; Start-up time: 6 CK + 64 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_4MHZ_6CK_0MS_gc         (0x03) /* Int. RC Osc. 4 MHz; Start-up time: 6 CK + 0 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_4MHZ_6CK_4MS_gc         (0x13) /* Int. RC Osc. 4 MHz; Start-up time: 6 CK + 4 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_4MHZ_6CK_64MS_gc        (0x23) /* Int. RC Osc. 4 MHz; Start-up time: 6 CK + 64 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_8MHZ_6CK_0MS_gc         (0x04) /* Int. RC Osc. 8 MHz; Start-up time: 6 CK + 0 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_8MHZ_6CK_4MS_gc         (0x14) /* Int. RC Osc. 8 MHz; Start-up time: 6 CK + 4 ms */
#define FUSE_SUT_CKSEL_INTRCOSC_8MHZ_6CK_64MS_gc        (0x24) /* Int. RC Osc. 8 MHz; Start-up time: 6 CK + 64 ms */
#define FUSE_SUT_CKSEL_EXTRCOSC_XX_0MHZ9_18CK_0MS_gc    (0x05) /* Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 0 ms */
#define FUSE_SUT_CKSEL_EXTRCOSC_XX_0MHZ9_18CK_4MS_gc    (0x15) /* Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 4 ms */
#define FUSE_SUT_CKSEL_EXTRCOSC_XX_0MHZ9_18CK_64MS_gc   (0x25) /* Ext. RC Osc.         -  0.9 MHz; Start-up time: 18 CK + 64 ms */
#define FUSE_SUT_CKSEL_EXTRCOSC_XX_0MHZ9_6CK_4MS_gc     (0x35) /* Ext. RC Osc.         -  0.9 MHz; Start-up time: 6 CK + 4 ms */
#define FUSE_SUT_CKSEL_EXTRCOSC_0MHZ9_3MHZ_18CK_0MS_gc  (0x06) /* Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 0 ms */
#define FUSE_SUT_CKSEL_EXTRCOSC_0MHZ9_3MHZ_18CK_4MS_gc  (0x16) /* Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 4 ms */
#define FUSE_SUT_CKSEL_EXTRCOSC_0MHZ9_3MHZ_18CK_64MS_gc (0x26) /* Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 18 CK + 64 ms */
#define FUSE_SUT_CKSEL_EXTRCOSC_0MHZ9_3MHZ_6CK_4MS_gc   (0x36) /* Ext. RC Osc. 0.9 MHz -  3.0 MHz; Start-up time: 6 CK + 4 ms */
#define FUSE_SUT_CKSEL_EXTRCOSC_3MHZ_8MHZ_18CK_0MS_gc   (0x07) /* Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 0 ms */
#define FUSE_SUT_CKSEL_EXTRCOSC_3MHZ_8MHZ_18CK_4MS_gc   (0x17) /* Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 4 ms */
#define FUSE_SUT_CKSEL_EXTRCOSC_3MHZ_8MHZ_18CK_64MS_gc  (0x27) /* Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 18 CK + 64 ms */
#define FUSE_SUT_CKSEL_EXTRCOSC_3MHZ_8MHZ_6CK_4MS_gc    (0x37) /* Ext. RC Osc. 3.0 MHz -  8.0 MHz; Start-up time: 6 CK + 4 ms */
#define FUSE_SUT_CKSEL_EXTRCOSC_8MHZ_12MHZ_18CK_0MS_gc  (0x08) /* Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 0 ms */
#define FUSE_SUT_CKSEL_EXTRCOSC_8MHZ_12MHZ_18CK_4MS_gc  (0x18) /* Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 4 ms */
#define FUSE_SUT_CKSEL_EXTRCOSC_8MHZ_12MHZ_18CK_64MS_gc (0x28) /* Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 18 CK + 64 ms */
#define FUSE_SUT_CKSEL_EXTRCOSC_8MHZ_12MHZ_6CK_4MS_gc   (0x38) /* Ext. RC Osc. 8.0 MHz - 12.0 MHz; Start-up time: 6 CK + 4 ms */
#define FUSE_SUT_CKSEL_EXTLOFXTAL_1KCK_4MS_gc           (0x09) /* Ext. Low-Freq. Crystal; Start-up time: 1K CK + 4 ms */
#define FUSE_SUT_CKSEL_EXTLOFXTAL_1KCK_64MS_gc          (0x19) /* Ext. Low-Freq. Crystal; Start-up time: 1K CK + 64 ms */
#define FUSE_SUT_CKSEL_EXTLOFXTAL_32KCK_64MS_gc         (0x29) /* Ext. Low-Freq. Crystal; Start-up time: 32K CK + 64 ms */
#define FUSE_SUT_CKSEL_EXTLOFXTALRES_258CK_4MS_gc       (0x0A) /* Ext. Crystal/Resonator Low Freq.; Start-up time: 258 CK + 4 ms */
#define FUSE_SUT_CKSEL_EXTLOFXTALRES_258CK_64MS_gc      (0x1A) /* Ext. Crystal/Resonator Low Freq.; Start-up time: 258 CK + 64 ms */
#define FUSE_SUT_CKSEL_EXTLOFXTALRES_1KCK_0MS_gc        (0x2A) /* Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 0 ms */
#define FUSE_SUT_CKSEL_EXTLOFXTALRES_1KCK_4MS_gc        (0x3A) /* Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 4 ms */
#define FUSE_SUT_CKSEL_EXTLOFXTALRES_1KCK_64MS_gc       (0x0B) /* Ext. Crystal/Resonator Low Freq.; Start-up time: 1K CK + 64 ms */
#define FUSE_SUT_CKSEL_EXTLOFXTALRES_16KCK_0MS_gc       (0x1B) /* Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 0 ms */
#define FUSE_SUT_CKSEL_EXTLOFXTALRES_16KCK_4MS_gc       (0x2B) /* Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 4 ms */
#define FUSE_SUT_CKSEL_EXTLOFXTALRES_16KCK_64MS_gc      (0x3B) /* Ext. Crystal/Resonator Low Freq.; Start-up time: 16K CK + 64 ms */
#define FUSE_SUT_CKSEL_EXTMEDFXTALRES_258CK_4MS_gc      (0x0C) /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 258 CK + 4 ms */
#define FUSE_SUT_CKSEL_EXTMEDFXTALRES_258CK_64MS_gc     (0x1C) /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 258 CK + 64 ms */
#define FUSE_SUT_CKSEL_EXTMEDFXTALRES_1KCK_0MS_gc       (0x2C) /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 0 ms */
#define FUSE_SUT_CKSEL_EXTMEDFXTALRES_1KCK_4MS_gc       (0x3C) /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 4 ms */
#define FUSE_SUT_CKSEL_EXTMEDFXTALRES_1KCK_64MS_gc      (0x0D) /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 1K CK + 64 ms */
#define FUSE_SUT_CKSEL_EXTMEDFXTALRES_16KCK_0MS_gc      (0x1D) /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 0 ms */
#define FUSE_SUT_CKSEL_EXTMEDFXTALRES_16KCK_4MS_gc      (0x2D) /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 4 ms */
#define FUSE_SUT_CKSEL_EXTMEDFXTALRES_16KCK_64MS_gc     (0x3D) /* Ext. Crystal/Resonator Medium Freq.; Start-up time: 16K CK + 64 ms */
#define FUSE_SUT_CKSEL_EXTHIFXTALRES_258CK_4MS_gc       (0x0E) /* Ext. Crystal/Resonator High Freq.; Start-up time: 258 CK + 4 ms */
#define FUSE_SUT_CKSEL_EXTHIFXTALRES_258CK_64MS_gc      (0x1E) /* Ext. Crystal/Resonator High Freq.; Start-up time: 258 CK + 64 ms */
#define FUSE_SUT_CKSEL_EXTHIFXTALRES_1KCK_0MS_gc        (0x2E) /* Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 0 ms */
#define FUSE_SUT_CKSEL_EXTHIFXTALRES_1KCK_4MS_gc        (0x3E) /* Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 4 ms */
#define FUSE_SUT_CKSEL_EXTHIFXTALRES_1KCK_64MS_gc       (0x0F) /* Ext. Crystal/Resonator High Freq.; Start-up time: 1K CK + 64 ms */
#define FUSE_SUT_CKSEL_EXTHIFXTALRES_16KCK_0MS_gc       (0x1F) /* Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 0 ms */
#define FUSE_SUT_CKSEL_EXTHIFXTALRES_16KCK_4MS_gc       (0x2F) /* Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 4 ms */
#define FUSE_SUT_CKSEL_EXTHIFXTALRES_16KCK_64MS_gc      (0x3F) /* Ext. Crystal/Resonator High Freq.; Start-up time: 16K CK + 64 ms */


