stevenj/avr-libc3/include/avr/io/atmega8515.h
/* USART - USART (0x0000) */
#define USART_BASE      _SFR_MEM8 (0x0000) /* USART Base Address */
#define USART_UBRRL     _SFR_MEM8 (0x0029) /* USART Baud Rate Register Low Byte */
#define USART_UCSRB     _SFR_MEM8 (0x002A) /* USART Control and Status Register B */
#define USART_UCSRA     _SFR_MEM8 (0x002B) /* USART Control and Status Register A */
#define USART_UDR       _SFR_MEM8 (0x002C) /* USART I/O Data Register */
#define USART_UCSRC     _SFR_MEM8 (0x0040) /* USART Control and Status Register C */
#define USART_UBRRH     _SFR_MEM8 (0x0040) /* USART Baud Rate Register High Byte */

/* SPI - Serial Peripheral Interface (0x0000) */
#define SPI_BASE        _SFR_MEM8 (0x0000) /* SPI Base Address */
#define SPI_SPCR        _SFR_MEM8 (0x002D) /* SPI Control Register */
#define SPI_SPSR        _SFR_MEM8 (0x002E) /* SPI Status Register */
#define SPI_SPDR        _SFR_MEM8 (0x002F) /* SPI Data Register */

/* CPU - CPU Registers (0x0000) */
#define CPU_BASE        _SFR_MEM8 (0x0000) /* CPU Base Address */
#define CPU_OSCCAL      _SFR_MEM8 (0x0024) /* Oscillator Calibration Value */
#define CPU_SFIOR       _SFR_MEM8 (0x0050) /* Special Function IO Register */
#define CPU_MCUCSR      _SFR_MEM8 (0x0054) /* MCU Control And Status Register */
#define CPU_MCUCR       _SFR_MEM8 (0x0055) /* MCU Control Register */
#define CPU_EMCUCR      _SFR_MEM8 (0x0056) /* Extended MCU Control Register */
#define CPU_SPMCR       _SFR_MEM8 (0x0057) /* Store Program Memory Control Register */
#define CPU_SP          _SFR_MEM16(0x005D) /* Stack Pointer  */
#define CPU_SPL         _SFR_MEM8 (0x005D) /* Stack Pointer  LOW BYTE */
#define CPU_SPH         _SFR_MEM8 (0x005E) /* Stack Pointer  HIGH BYTE */
#define CPU_SREG        _SFR_MEM8 (0x005F) /* Status Register */

/* EXINT - External Interrupts (0x0000) */
#define EXINT_BASE      _SFR_MEM8 (0x0000) /* EXINT Base Address */
#define EXINT_GIFR      _SFR_MEM8 (0x005A) /* General Interrupt Flag Register */
#define EXINT_GICR      _SFR_MEM8 (0x005B) /* General Interrupt Control Register */

/* WDT - Watchdog Timer (0x0000) */
#define WDT_BASE        _SFR_MEM8 (0x0000) /* WDT Base Address */
#define WDT_WDTCR       _SFR_MEM8 (0x0041) /* Watchdog Timer Control Register */

/* TC0 - Timer/Counter, 8-bit (0x0000) */
#define TC8_BASE        _SFR_MEM8 (0x0000) /* TC8 Base Address */
#define TC8_OCR0        _SFR_MEM8 (0x0051) /* Timer/Counter 0 Output Compare Register */
#define TC8_TCNT0       _SFR_MEM8 (0x0052) /* Timer/Counter 0 Register */
#define TC8_TCCR0       _SFR_MEM8 (0x0053) /* Timer/Counter 0 Control Register */
#define TC8_TIFR        _SFR_MEM8 (0x0058) /* Timer/Counter Interrupt Flag register */
#define TC8_TIMSK       _SFR_MEM8 (0x0059) /* Timer/Counter Interrupt Mask Register */

/* TC1 - Timer/Counter, 16-bit (0x0000) */
#define TC16_BASE       _SFR_MEM16(0x0000) /* TC16 Base Address */
#define TC16_ICR1       _SFR_MEM16(0x0044) /* Timer/Counter1 Input Capture Register  Bytes */
#define TC16_ICR1L      _SFR_MEM8 (0x0044) /* Timer/Counter1 Input Capture Register  Bytes LOW BYTE */
#define TC16_ICR1H      _SFR_MEM8 (0x0045) /* Timer/Counter1 Input Capture Register  Bytes HIGH BYTE */
#define TC16_OCR1B      _SFR_MEM16(0x0048) /* Timer/Counter1 Output Compare Register B  Bytes */
#define TC16_OCR1BL     _SFR_MEM8 (0x0048) /* Timer/Counter1 Output Compare Register B  Bytes LOW BYTE */
#define TC16_OCR1BH     _SFR_MEM8 (0x0049) /* Timer/Counter1 Output Compare Register B  Bytes HIGH BYTE */
#define TC16_OCR1A      _SFR_MEM16(0x004A) /* Timer/Counter1 Output Compare Register A  Bytes */
#define TC16_OCR1AL     _SFR_MEM8 (0x004A) /* Timer/Counter1 Output Compare Register A  Bytes LOW BYTE */
#define TC16_OCR1AH     _SFR_MEM8 (0x004B) /* Timer/Counter1 Output Compare Register A  Bytes HIGH BYTE */
#define TC16_TCNT1      _SFR_MEM16(0x004C) /* Timer/Counter1  Bytes */
#define TC16_TCNT1L     _SFR_MEM8 (0x004C) /* Timer/Counter1  Bytes LOW BYTE */
#define TC16_TCNT1H     _SFR_MEM8 (0x004D) /* Timer/Counter1  Bytes HIGH BYTE */
#define TC16_TCCR1B     _SFR_MEM8 (0x004E) /* Timer/Counter1 Control Register B */
#define TC16_TCCR1A     _SFR_MEM8 (0x004F) /* Timer/Counter1 Control Register A */
#define TC16_TIFR       _SFR_MEM8 (0x0058) /* Timer/Counter Interrupt Flag register */
#define TC16_TIMSK      _SFR_MEM8 (0x0059) /* Timer/Counter Interrupt Mask Register */

/* PORTA - I/O Port (0x0000) */
#define PORTAA_BASE     _SFR_MEM8 (0x0000) /* PORTAA Base Address */
#define PORTAA_PINA     _SFR_MEM8 (0x0039) /* Port A Input Pins */
#define PORTAA_DDRA     _SFR_MEM8 (0x003A) /* Port A Data Direction Register */
#define PORTAA_PORTA    _SFR_MEM8 (0x003B) /* Port A Data Register */

/* PORTB - I/O Port (0x0000) */
#define PORTBB_BASE     _SFR_MEM8 (0x0000) /* PORTBB Base Address */
#define PORTBB_PINB     _SFR_MEM8 (0x0036) /* Port B Input Pins */
#define PORTBB_DDRB     _SFR_MEM8 (0x0037) /* Port B Data Direction Register */
#define PORTBB_PORTB    _SFR_MEM8 (0x0038) /* Port B Data Register */

/* PORTC - I/O Port (0x0000) */
#define PORTCC_BASE     _SFR_MEM8 (0x0000) /* PORTCC Base Address */
#define PORTCC_PINC     _SFR_MEM8 (0x0033) /* Port C Input Pins */
#define PORTCC_DDRC     _SFR_MEM8 (0x0034) /* Port C Data Direction Register */
#define PORTCC_PORTC    _SFR_MEM8 (0x0035) /* Port C Data Register */

/* PORTD - I/O Port (0x0000) */
#define PORTDD_BASE     _SFR_MEM8 (0x0000) /* PORTDD Base Address */
#define PORTDD_PIND     _SFR_MEM8 (0x0030) /* Port D Input Pins */
#define PORTDD_DDRD     _SFR_MEM8 (0x0031) /* Port D Data Direction Register */
#define PORTDD_PORTD    _SFR_MEM8 (0x0032) /* Port D Data Register */

/* PORTE - I/O Port (0x0000) */
#define PORTEE_BASE     _SFR_MEM8 (0x0000) /* PORTEE Base Address */
#define PORTEE_PINE     _SFR_MEM8 (0x0025) /* Port E Input Pins */
#define PORTEE_DDRE     _SFR_MEM8 (0x0026) /* Port E Data Direction Register */
#define PORTEE_PORTE    _SFR_MEM8 (0x0027) /* Port E Data Register */

/* EEPROM - EEPROM (0x0000) */
#define EEPROM_BASE     _SFR_MEM8 (0x0000) /* EEPROM Base Address */
#define EEPROM_EECR     _SFR_MEM8 (0x003C) /* EEPROM Control Register */
#define EEPROM_EEDR     _SFR_MEM8 (0x003D) /* EEPROM Data Register */
#define EEPROM_EEAR     _SFR_MEM16(0x003E) /* EEPROM Address Register  Bytes */
#define EEPROM_EEARL    _SFR_MEM8 (0x003E) /* EEPROM Address Register  Bytes LOW BYTE */
#define EEPROM_EEARH    _SFR_MEM8 (0x003F) /* EEPROM Address Register  Bytes HIGH BYTE */

/* FUSE - Fuses (0x0000) */
#define FUSE_BASE       _SFR_MEM8 (0x0000) /* FUSE Base Address */
#define FUSE_LOW        _SFR_MEM8 (0x0000) 
#define FUSE_HIGH       _SFR_MEM8 (0x0001) 

/* LOCKBIT - Lockbits (0x0000) */
#define LOCKBIT_BASE    _SFR_MEM8 (0x0000) /* LOCKBIT Base Address */
#define LOCKBIT_LOCKBIT _SFR_MEM8 (0x0000) 
/* avr-libc typedef for avr/fuse.h */
typedef FUSE_t NVM_FUSES_t;

