stevenj/avr-libc3/include/avr/io/atmega8515.h
/*
================================================================================
Interrupt Vector Definitions
================================================================================
*/

/* Vector 0 is the reset vector */
#define None_RESET_vect_num        (0)                 
#define None_RESET_vect            _VECTOR(0)          /* External Reset, Power-on Reset and Watchdog Reset */
#define None_INT0_vect_num         (1)                 
#define None_INT0_vect             _VECTOR(1)          /* External Interrupt Request 0 */
#define None_INT1_vect_num         (2)                 
#define None_INT1_vect             _VECTOR(2)          /* External Interrupt Request 1 */
#define None_TIMER1_CAPT_vect_num  (3)                 
#define None_TIMER1_CAPT_vect      _VECTOR(3)          /* Timer/Counter1 Capture Event */
#define None_TIMER1_COMPA_vect_num (4)                 
#define None_TIMER1_COMPA_vect     _VECTOR(4)          /* Timer/Counter1 Compare Match A */
#define None_TIMER1_COMPB_vect_num (5)                 
#define None_TIMER1_COMPB_vect     _VECTOR(5)          /* Timer/Counter1 Compare MatchB */
#define None_TIMER1_OVF_vect_num   (6)                 
#define None_TIMER1_OVF_vect       _VECTOR(6)          /* Timer/Counter1 Overflow */
#define None_TIMER0_OVF_vect_num   (7)                 
#define None_TIMER0_OVF_vect       _VECTOR(7)          /* Timer/Counter0 Overflow */
#define None_SPI_STC_vect_num      (8)                 
#define None_SPI_STC_vect          _VECTOR(8)          /* Serial Transfer Complete */
#define None_USART_RX_vect_num     (9)                 
#define None_USART_RX_vect         _VECTOR(9)          /* USART, Rx Complete */
#define None_USART_UDRE_vect_num   (10)                
#define None_USART_UDRE_vect       _VECTOR(10)         /* USART Data Register Empty */
#define None_USART_TX_vect_num     (11)                
#define None_USART_TX_vect         _VECTOR(11)         /* USART, Tx Complete */
#define None_ANA_COMP_vect_num     (12)                
#define None_ANA_COMP_vect         _VECTOR(12)         /* Analog Comparator */
#define None_INT2_vect_num         (13)                
#define None_INT2_vect             _VECTOR(13)         /* External Interrupt Request 2 */
#define None_TIMER0_COMP_vect_num  (14)                
#define None_TIMER0_COMP_vect      _VECTOR(14)         /* Timer 0 Compare Match */
#define None_EE_RDY_vect_num       (15)                
#define None_EE_RDY_vect           _VECTOR(15)         /* EEPROM Ready */
#define None_SPM_RDY_vect_num      (16)                
#define None_SPM_RDY_vect          _VECTOR(16)         /* Store Program Memory Ready */

/* Vector Table Size */
#define _VECTOR_SIZE               (2)                 /* Size of individual vector. */
#define _VECTORS_SIZE              (17 * _VECTOR_SIZE) /* Size of all vectors */
/*
================================================================================
Constants
================================================================================
*/

#define PROGMEM_START            (0x0000)                                         
#define PROGMEM_SIZE             (0x2000)                                         
#define PROGMEM_END              (PROGMEM_START + PROGMEM_SIZE - 1)               

#define FLASH_START              (0x0000)                                         
#define FLASH_SIZE               (0x2000)                                         
#define FLASH_PAGE_SIZE          (0x0040)                                         
#define FLASH_END                (FLASH_START + FLASH_SIZE - 1)                   

#define BOOT_SECTION_1_START     (0x1F00)                                         
#define BOOT_SECTION_1_SIZE      (0x0100)                                         
#define BOOT_SECTION_1_PAGE_SIZE (0x0040)                                         
#define BOOT_SECTION_1_END       (BOOT_SECTION_1_START + BOOT_SECTION_1_SIZE - 1) 

#define BOOT_SECTION_2_START     (0x1E00)                                         
#define BOOT_SECTION_2_SIZE      (0x0200)                                         
#define BOOT_SECTION_2_PAGE_SIZE (0x0040)                                         
#define BOOT_SECTION_2_END       (BOOT_SECTION_2_START + BOOT_SECTION_2_SIZE - 1) 

#define BOOT_SECTION_3_START     (0x1C00)                                         
#define BOOT_SECTION_3_SIZE      (0x0400)                                         
#define BOOT_SECTION_3_PAGE_SIZE (0x0040)                                         
#define BOOT_SECTION_3_END       (BOOT_SECTION_3_START + BOOT_SECTION_3_SIZE - 1) 

#define BOOT_SECTION_4_START     (0x1800)                                         
#define BOOT_SECTION_4_SIZE      (0x0800)                                         
#define BOOT_SECTION_4_PAGE_SIZE (0x0040)                                         
#define BOOT_SECTION_4_END       (BOOT_SECTION_4_START + BOOT_SECTION_4_SIZE - 1) 

#define SIGNATURESMEM_START  (0x0000)                                       
#define SIGNATURESMEM_SIZE   (0x0003)                                       
#define SIGNATURESMEM_END    (SIGNATURESMEM_START + SIGNATURESMEM_SIZE - 1) 

#define SIGNATURES_START     (0x0000)                                       
#define SIGNATURES_SIZE      (0x0003)                                       
#define SIGNATURES_PAGE_SIZE (0x0001)                                       
#define SIGNATURES_END       (SIGNATURES_START + SIGNATURES_SIZE - 1)       

#define FUSESMEM_START  (0x0000)                             
#define FUSESMEM_SIZE   (0x0002)                             
#define FUSESMEM_END    (FUSESMEM_START + FUSESMEM_SIZE - 1) 

#define FUSES_START     (0x0000)                             
#define FUSES_SIZE      (0x0002)                             
#define FUSES_PAGE_SIZE (0x0001)                             
#define FUSES_END       (FUSES_START + FUSES_SIZE - 1)       

#define LOCKBITSMEM_START  (0x0000)                                   
#define LOCKBITSMEM_SIZE   (0x0001)                                   
#define LOCKBITSMEM_END    (LOCKBITSMEM_START + LOCKBITSMEM_SIZE - 1) 

#define LOCKBITS_START     (0x0000)                                   
#define LOCKBITS_SIZE      (0x0001)                                   
#define LOCKBITS_PAGE_SIZE (0x0001)                                   
#define LOCKBITS_END       (LOCKBITS_START + LOCKBITS_SIZE - 1)       

